# OLDSetLoadDataStr

## Description
Using selector, sets load data with string value for the parametric object

```pascal
PROCEDURE OLDSetLoadDataStr(
				handle    : HANDLE;
				selector  : INTEGER;
				value     : STRING;
				loadIndex : INTEGER);
```

```python

def vs.OLDSetLoadDataStr(handle, selector, value, loadIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|selector|INTEGER||
|value|STRING||
|loadIndex|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis